Catalogs/ГруппыДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>ГруппыДоступа</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/УправлениеДоступомСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбновитьРолиПользователя(ПользовательСсылка, ГруппаДоступаСсылка) Экспорт

	Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
													ПользовательСсылка.УникальныйИднтификаторПользователя);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыДоступаРоли.Ссылка КАК Ссылка,
		|	ГруппыДоступаРоли.Роль КАК Роль
		|ИЗ
		|	Справочник.ГруппыДоступа.Роли КАК ГруппыДоступаРоли
		|ГДЕ
		|	ГруппыДоступаРоли.Ссылка = &ГруппаДоступа";
	
	Запрос.УстановитьПараметр("ГруппаДоступа", ГруппаДоступаСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = РезультатЗапроса.Выгрузить();
	
	Для каждого СтрокаРезультата Из Результат Цикл
		
		ОбъектМетаданныхРоль = Метаданные.Роли.Найти(СтрокаРезультата.Роль.Наименование);
		Если НЕ Пользователь.Роли.Содержит(ОбъектМетаданныхРоль) Тогда
			Пользователь.Роли.Добавить(ОбъектМетаданныхРоль);
		КонецЕсли;
	
	КонецЦикла;
	
	Пользователь.Записать();

КонецПроцедуры

Функция ПроверитьРоль(Роль) Экспорт

	Возврат РольДоступна("ПолныеПрава") ИЛИ РольДоступна(Роль);

КонецФункции // ПроверитьРоль()

#КонецОбласти
